Repository: mahtiankka/FI-tekstit
Catalog: Drawing/Drawing1_0_2/*.po
Languages: fi

source: Shuffle pixels
fi: Sekoita pikseleitä

source: Shuffle and blur
fi: Sekoita ja sumenna

source: Mosaic
fi: Mosaiikki

source: Solid color
fi: Tasainen väri

source: Change saturation
fi: Vaihda kylläisyys

source: Veil
fi: Peite

source: Add transparency
fi: Lisää läpinäkyvyyttä

source: Increase contrast
fi: Lisää kontrastia

source: Blurring
fi: Sumentaminen

source: Fast blur
fi: Sumennus nopea

source: Slow blur
fi: Sumennus hidas

source: Blur direction
fi: Sumennuksen suunta

source: No direction
fi: Ei suuntaa

source: Blur horizontally
fi: Sumennus vaaka

source: Blur vertically
fi: Sumennus pysty

source: Invert colors
fi: Käänteiset värit

source: Straighten the line
fi: Suorista viivaa

source: Color gradient
fi: Liukuväri

source: Locked direction
fi: Lukittu suunta

source: Behavior
fi: Toiminta

source: Encircle and fill
fi: Ympäröi ja täytä

source: Erase and replace
fi: Pyyhi ja korvaa

source: Entire image
fi: Koko kuva

source: Dots type
fi: Pisteen muoto

source: Circle
fi: Ympyrä

source: Cross
fi: Tähti

source: X-shaped cross
fi: Risti X

source: Include a number
fi: Numeroita

source: Next number
fi: Seuraava numero

source: Reset number
fi: Numerot alusta

source: Decrement number
fi: Numero taakse

source: Increment number
fi: Numero yli

source: Solid outline
fi: Tasainen kehysviiva

source: Dashed outline
fi: Katkonainen kehysviiva

source: No outline
fi: Ei kehystä

source: Filling
fi: Täyttö

source: Empty shape
fi: Ilman täyttöä

source: Horizontal gradient
fi: Liukuväri vaaka

source: Vertical gradient
fi: Liukuväri pysty

source: Radial gradient
fi: Liukuväri keskeltä

source: Rectangle
fi: Suorakulmio

source: Rounded rectangle
fi: Suorakulmio pyöristetty

source: Oval
fi: Soikea

source: Polygon
fi: Monikulmio

source: Free shape
fi: Vapaa muoto

source: Close shape
fi: Sulje muoto

source: Insert here
fi: Lisää tähän

source: Font
fi: Fontti

source: Select a font…
fi: Valitse fontti…

source: Italic
fi: Kursiivi

source: Bold
fi: Vahva

source: Background
fi: Tausta

source: No background
fi: Ei taustaa

source: Shadow
fi: Varjo

source: Thin outline
fi: Ohut ääriviiva

source: Thick outline
fi: Paksu ääriviiva

source: Rectangle background
fi: Suorakulmainen tausta

source: Curve
fi: Kaariviiva

source: Curve options
fi: Kaariviiva valinnat

source: Draw a second segment to complete the curve
fi: Piirrä toinen osa ja suorita kaariviiva loppuun

source: Dashed arrow
fi: Katkoviivainen nuoli

source: Arrow
fi: Nuoli

source: Dashed
fi: Katkoviiva

source: Press <Alt> to toggle the 'outline' option
fi: Paina <Alt> ja vaihda ääriviivaa

source: Brush options
fi: Sivellin valinnat

source: Press <Shift> to erase a path instead
fi: Voit poistaa polun painamalla <Shift>

source: Press <Shift> to erase a rectangle area instead
fi: Voit poistaa suorakaiteen alueen painamalla <Shift>

source: Eraser options
fi: Pyyhekumi valinnat

source: Press <Shift> to temporarily highlight on dark background instead
fi: Paina <Shift> tämä korostaa tilapäisesti tummaa taustaa

source: Press <Shift> to temporarily highlight on light background instead
fi: Paina <Shift> tämä korostaa tilapäisesti vaaleaa taustaa

source: Highlighter options
fi: Korostus valinnat

source: Line
fi: Viiva

source: Width: %spx
fi: Leveys: %spx

source: Height: %spx
fi: Korkeus: %spx

source: Length: %spx
fi: Pituus: %spx

source: Line options
fi: Viiva valinnat

source: Press <Shift> to unlock the line direction
fi: Paina <Shift> ja vapauta viivan suunta

source: Press <Shift> to lock the line direction
fi: Paina <Shift> ja vapauta viivan suunta

source: Painting options
fi: Maalikannu valinnat

source: Click on an area to replace its color by transparency
fi: Paina aluetta ja korvaa sen väri läpinäkyvyydellä

source: Click on the canvas to entirely paint it
fi: Paina alustaa ja maalaa se kokonaan

source: May not work for complex shapes
fi: Tämä ei ehkä toimi monimutkaisille muodoille

source: It will not work well if the area's edges are blurry
fi: Tämä ei toimi hyvin jos alueen reunat on pehmennetty

source: Pencil
fi: Kynä

source: Pencil options
fi: Kynä valinnat

source: Points options
fi: Piste valinnat

source: Next number: %s
fi: Seuraava numero: %s

source: Filled with main color
fi: Täytetty päävärillä

source: Filled with secondary color
fi: Täytetty toisella värillä

source: Shape
fi: Muoto

source: Radius: %spx
fi: Säde: %spx

source: Shape options
fi: Muoto valinnat

source: Click on the shape's first point to close it.
fi: Paina muodon ensimmäistä kohtaa ja se sulkeutuu.

source: Press <Alt>, <Shift>, or both, to quickly change the 'filling' option
fi: Paina <Alt>, <Shift> tai molempia vaihtaaksesi "täytön" vaihtoehtoja

source: Text
fi: Teksti

source: Text options
fi: Teksti valinnat

source: Grab the rectangle to adjust the text position
fi: Tartu suorakulmioon siirrä tekstin sijaintia

source: Click outside the rectangle to apply
fi: Paina suorakulmion ulkopuolella käyttääksesi

source: Density depends on the stylus pressure
fi: Jälki riippuu kynän paineesta

source: Density depends on the mouse speed
fi: Jälki riippuu hiiren nopeudesta

source: Width depends on the stylus pressure
fi: Leveys riippuu kynän paineesta

source: Width depends on the line orientation
fi: Leveys riippuu viivan suunnasta

source: Width depends on the mouse speed
fi: Leveys riippuu hiiren nopeudesta

source: Drag the selection or right-click on the canvas
fi: Vedä valintaa tai paina hiiren oikeaa painiketta alustalla

source: Select an area or right-click on the canvas
fi: Valitse alue tai paina hiiren oikeaa painiketta alustalla

source: Rectangle selection
fi: Alueen valinta

source: Error: invalid values
fi: Virhe: virheelliset arvot

source: Expanding options
fi: Laajennus valinnat

source: The sides you'll crop are hinted by the mouse pointer
fi: Rajatessa hiiren osoitin vihjaa rajattavalle sivuille

source: Cropping the selection
fi: Rajaa valintaan

source: Cropping or expanding the canvas
fi: Alustan rajaaminen tai laajennus

source: Don't forget to confirm the operation!
fi: Muista vahvistaa toiminto!

source: Press <Alt>, <Shift>, or both, to quickly change the 'expand with' option
fi: Paina <Alt>tai <Shift> vaihtaaksesi "laajenna" vaihtoehtoja

source: Active filter
fi: Aktiivinen suodatin

source: Click on the image to preview the selected filter
fi: Painamalla kuvaa voit esikatsella valittua suodatinta

source: Emboss
fi: Kohokuvio

source: Rotating options
fi: Kääntö vailinnat

source: Rotating the selection
fi: Valinnan kääntäminen

source: Rotating the canvas
fi: Alustan kääntäminen

source: Scaling options
fi: Skaalaus valinnat

source: Scaling the selection
fi: Skaalaus valintaan

source: Scaling the canvas
fi: Skaalaus alustan kokoon

source: Press <Shift> to quickly toggle the 'lock proportions' option
fi: Paina <Shift> vaihtaaksesi "lukitus" valintaa

source: Skewing options
fi: Kallista valinnat

source: The directions of the deformation are hinted by the mouse pointer
fi: Muodonmuutos vihjataan hiiren osoittimella

source: Skewing the selection
fi: Kallista valintaan

source: Skewing the canvas
fi: Kallista alustaa

source: Blur radius
fi: Sumennus säde

source: Saturation
fi: Kylläisyys
