Repository: mahtiankka/FI-tekstit
Catalog: Drawing/Drawing1_0_2/*.po
Languages: fi

source: Drawing
fi: Piirtäminen

source: Simple drawing utility
fi: Drawing on helppo piirustus apuohjelma

source: Paint;Sketch;Pencil;
fi: Paint;Maalaus;Kynä;Piirtäminen;Kuvankäsittely;

source: New Window
fi: Uusi ikkuna

source: New Image
fi: Uusi kuva

source: Edit Image in Clipboard
fi: Muokkaa kuvaa leikepöydällä

source: Edit screenshots or memes
fi: Muokkaa kuvakaappauksia tai meemejä

source: This basic image editor can resize, crop, or rotate an image, apply simple filters, insert or censor text, and manipulate a selected portion of the picture (cut/copy/paste/drag/…)
fi: Tämä on kätevä ohjelma piirtämiseen, jolla voi muuttaa kuvan kokoa, rajata tai kääntää, käyttää suodattimia, lisää tai poista tekstiä ja muokata valittua aluetta (leikkaa/kopioi/liitä/vedä/…)

source: And of course, you can draw! Using tools such as the pencil, the straight line, the curve tool, many shapes, several brushes, and their various colors and options.
fi: Tietysti voit piirtää! Käytä työkaluja, kuten kynää, viivaa, kaariviivaa, muotoja, siveltimiä ja eri värejä.

source: Supported file types include PNG, JPEG and BMP.
fi: Tuetut tiedostotyypit ovat png, jpeg ja bmp.

source: Version 1.2.0 improves the transformation tools: their previews are now consistently applied when you change the active tool without clicking on "apply".
fi: Versiossa 1.0.2 on paremmat muuntotyökalut: niiden esikatselu on nyt johdonmukaista kun vaihdat aktiivista työkalua painamalla "käytä".

source: The text tool is more intuitive to use, with distinct areas on the canvas to edit, move and insert the text.
fi: Tekstiä on helpompi työstää, sillä alustalla on erillinen alue tekstin muokkaukseen, siirtämiseen ja lisäämiseen.

source: A former option of the paint bucket tool, which didn't belong there, has been improved and moved to the eraser tool.
fi: Maalikannu on parempi ja siirretty pyyhekumin yhteyteen.

source: Transparency is henceforth correctly preserved when the "skew" tool expands the canvas with a solid color.
fi: Läpinäkyvyys säilyy vastedes oikein, kun "Kallista"-työkalu laajentaa alustaa yhtenäisellä värillä.

source: You can now adjust the position of the canvas when you're cropping it.
fi: Voit nyt säätää alustan paikkaa kun rajaat sitä.

source: The option to use a color editor by default has been moved from the main window to the preferences window, and its bug has been fixed.
fi: Värimuokkaus on siirretty pääikkunasta asetukset ikkunaan ja siihen liittyvä virhe on korjattu.

source: Version 1.0.2 features several minor bug fixes, and various new translations.
fi: Versio 1.0.2 sisältää useita pieniä korjauksia ja uusia eri kielien käännöksiä.

source: Saving the image should be more reliable, especially when replacing the transparent pixels with a solid color. Pictures are now automatically reloaded from the disk after being saved.
fi: Kuvan tallentaminen on luotettavampaa, varsinkin kun läpinäkyvät pikselit korvataan yksivärisillä. Kuvat ladataan automaattisesti levyltä uudelleen tallennuksen jälkeen.

source: The user interface of the "select" tool changed, as well as the keyboard shortcuts to change tab.
fi: "Valinta"-työkalun käyttöliittymä on muuttunut, samoin pikanäppäimet välilehden vaihtaminen.

source: A small rendering issue when previewing a blur filter has also been fixed.
fi: Renderöintiongelma sumennuksen esikatselussa on korjattu.

source: Version 1.0.1 features several minor bug fixes, and various new translations.
fi: Versio 1.0.1 sisältää useita pieniä korjauksia ja uusia ei kielien käännöksiä.

source: By popular demand, the "highlighter" tool is now enabled by default, and the message dialog to warn you about the release notes is less intrusive.
fi: Yleisön pyynnöstä "Korostus"-työkalu on nyt oletuksena käytössä ja julkaisutiedoista ilmoittava viesti-ikkuna on vähemmän häiritsevä.

source: The main improvement in this update is the zoom workflow: since the version 1.0.0 it's possible to zoom in very deep, but the process was very slow, and the view didn't stay well centered around the mouse pointer; and once at 2000%%, scrolling up or down, or left or right, was quite violent. These problems should all have disappeared in this new version!
fi: Tämän päivityksen tärkein parannus on suurentamisen työstäminen: versiosta 1.0.0 lähtien on mahdollista suurentaa hyvin syvälle, mutta prosessi oli erittäin hidas, eikä näkymä pysynyt hiiren osoittamalla alueella; ja 2000%%, rullaaminen eri suuntiin oli melko väkivaltaista. Kaikki nämä ongelmat ovat poissa tässä uudessa versiossa!

source: Incorrect command line parsing when using the app outside of a flatpak sandbox has also been fixed.
fi: Komentorivin virheellinen jäsennys hiekkalaatikon ulkopuolella (flatpak) on korjattu.

source: For users on elementary OS, a small issue concerning window resizing has been mended too.
fi: Elementary OS on korjattu pieni ongelma, joka liittyi ikkunoiden koon muuttamiseen.

source: Version 1.0.0 improves rendering performance, which is visible when editing large images with a poor CPU.
fi: Parempi renderöinti versiossa 1.0.0, joka näkyy muokatessa suuria kuvia huonolla suoritinteholla.

source: You can now use the new "skew" tool, to tilt an image from a rectangle to a parallelogram. Such a deformation can be applied horizontally or vertically.
fi: Voit käyttää uutta "Kallista"-työkalua kuvan kallistamiseen. Muodonmuutosta voidaan soveltaa vaaka- tai pystyasentoon.

source: You can select tools with keyboard accelerators (Alt+letter). This may not work yet with languages using a non-latin alphabet.
fi: Voit valita työkaluja nopeasti näppäimistöltä (Alt+kirjain). Tämä ei välttämättä toimi kielissä, jotka käyttävät muita kuin latinalaisia aakkosia.

source: Zooming very deep is now possible, and the rendering will be very crisp, even at 2000%%.
fi: Suurennus erittäin syvälle on nyt mahdollista ja renderöinti on erittäin terävää, jopa 2000%%.

source: Pressing "ctrl" will display the cursor coordinates in a tooltip. If you do it while using a tool, it may display additional data, for example the dimensions of the shape you're drawing!
fi: Painamalla "ctrl"-näppäintä kohdistin näyttää koordinaatit vihjeessä. Työkalua käytettäessä, se näyttää lisätietoja, esimerkiksi piirtämäsi muodon mitat!

source: Pressing "shift", or "alt" when using a tool enables specific options, such as locking the direction for the "line" tool, or changing the filling style of a shape.
fi: Painamalla "shift" tai "alt" työkalun käytön yhteydessä se mahdollistaa vailinnat, kuten "viiva"-työkalun suunnan lukitsemisen tai täyttötavan muuttamisen.

source: Using the "scale" tool, you may optionally set the new size as a relative percentage rather than an absolute value in pixels.
fi: Käyttämällä "Skaalaus"-työkalua voit asettaa uuden koon prosenttina pikselien absoluuttisen arvon sijaan.

source: The window and its primary menu
fi: Ikkuna ja sen valikko

source: The selection and the actions associated with it
fi: Valinta ja toiminnot

source: Zooming in various shapes
fi: Suurenna eri muodoissa

source: The "new image" menu opened
fi: Valikko "Uusi kuva" avautui

source: File
fi: Tiedosto

source: Open an image
fi: Avaa kuva

source: New Blank Image
fi: Uusi tyhjä kuva

source: New Image With Custom Size
fi: Uusi kuva, valitulla koolla

source: New Image From Selection
fi: Uusi kuva valinnasta

source: New Image From Clipboard
fi: Uusi kuva leikepöydältä

source: Reload file
fi: Lataa uudelleen

source: Image properties
fi: Kuvan ominaisuudet

source: Reset canvas
fi: Tyhjennä alusta

source: Save
fi: Tallenna

source: Save without transparency
fi: Tallenna ilman läpinäkyvyyttä

source: Prepare as NFT…
fi: Valmistaudu NFT…

source: Save as…
fi: Tallenna nimellä…

source: Export as…
fi: Vie…

source: Copy to clipboard
fi: Kopioi leikepöydälle

source: Print
fi: Tulosta

source: Close Image
fi: Sulje kuva

source: Close Window
fi: Sulje ikkuna

source: Quit all windows
fi: Sulje kaikki ikkunat

source: Edit
fi: Muokkaa

source: Undo
fi: Kumoa

source: Redo
fi: Toista

source: Rebuild from history
fi: Rakenna uudelleen historiasta

source: Select all
fi: Valitse kaikki

source: Cut
fi: Leikkaa

source: Copy
fi: Kopioi

source: Delete
fi: Poista

source: Paste
fi: Liitä

source: Import
fi: Tuo

source: Preferences
fi: Lisäasetukset

source: View
fi: Näytä

source: Preview
fi: Esikatselu

source: Zoom
fi: Suurennus

source: Optimal Zoom
fi: Optimaalinen

source: Zoom Out
fi: Pienennä

source: Original Zoom
fi: Alkuperäinen

source: Zoom In
fi: Suurenna

source: Position
fi: Paikka

source: Go Left
fi: Mene vasemmalle

source: Go Up
fi: Mene ylös

source: Go Down
fi: Mene alas

source: Go Right
fi: Mene oikealle

source: Go to the left end
fi: Siirry vasen alareuna

source: Go to the top
fi: Siirry suoraan ylös

source: Go to the bottom
fi: Siirry suoraan alas

source: Go to the right end
fi: Siirry oikea reuna

source: Tab at the left
fi: Välilehti vasemmalla

source: Tab at the right
fi: Välilehti oikealla

source: Refresh
fi: Virkistä

source: Track framerate
fi: Kuvataajuus

source: Dark theme variant
fi: Tumma teema

source: Show the menu-bar
fi: Näytä valikko

source: Hide toolbars
fi: Piilota työkalurivi

source: Fullscreen
fi: Kokonäyttö

source: Colors
fi: Värit

source: Edit Main Color…
fi: Muokkaa väri 1…

source: Edit Secondary Color…
fi: Muokkaa väri 2…

source: Exchange colors
fi: Vaihda värejä

source: Color application mode
fi: Värin sovellustila

source: Normal
fi: Normaali

source: Highlight
fi: Korosta

source: Dark text on light background
fi: Tumma teksti vaalealla taustalla

source: Light text on dark background
fi: Vaalea teksti tummalla taustalla

source: HSL modes
fi: Värimoodit HSL

source: Hue only
fi: Vain sävy

source: Saturation only
fi: Vain kylläisyys

source: Hue and saturation
fi: Sävy ja kylläisyys

source: Luminosity only
fi: Vain valovoima

source: Other modes
fi: Muut moodit

source: Raw source color
fi: Raw lähdeväri

source: Difference
fi: Eroavuus

source: Don't use the colors but…
fi: Älä käytä värejä, mutta…

source: Erase
fi: Pyyhi

source: Tools
fi: Työkalut

source: Previous tool
fi: Edellinen työkalu

source: Active tool
fi: Aktiivinen työkalu

source: Show tools names
fi: Työkalujen nimet

source: Bigger width
fi: Suurempi leveys

source: Smaller width
fi: Pienempi leveys

source: Troubleshoot selection
fi: Vianmääritys

source: Cancel transformation
fi: Peruuta muunnos

source: Apply transformation
fi: Käytä muunnosta

source: Options
fi: Valinnat

source: Help
fi: Apua

source: Shortcuts
fi: Pikakuvakkeet

source: Report a bug
fi: Ilmoita virheestä

source: Index
fi: Sisällysluettelo

source: Individual pages
fi: Yksittäiset ohjeet

source: Basic help
fi: Perusohjeet

source: Help about zooming
fi: Apua suurennukseen

source: Help about the full-screen mode
fi: Ohjeita koko näytön tilasta

source: Help about classic tools
fi: Ohjeita työkaluista

source: Help about colors
fi: Ohjeita väreihin

source: Help about transformation tools
fi: Ohjeita muuntamiseen

source: Help about selection
fi: Ohjeita valinnasta

source: What's new
fi: Mitä uutta?

source: About Drawing
fi: Tietoja ohjelmasta

source: Open
fi: Avaa

source: Share the image
fi: Jaa kuva

source: The image changed on the disk, do you want to reload it?
fi: Kuva kiintolevyllä vaihtui, haluatko ladata sen uudelleen?

source: Reload
fi: Lataa uudelleen

source: Maximum zoom
fi: Suurin suurennus

source: Width
fi: Leveä

source: Height
fi: Korkea

source: Color
fi: Väri

source: Use these settings by default
fi: Käytä asetuksia oletuksena

source: Images
fi: Kuvat

source: Window
fi: Ikkuna

source: pixels
fi: pikseliä

source: centimeters
fi: senttimetriä

source: inches
fi: tuumaa

source: Close selection
fi: Sulje valinta

source: Deselect
fi: Valitsematta

source: Crop
fi: Rajaa

source: Scale
fi: Koko

source: Rotate
fi: Kääntö

source: Skew
fi: Kallista

source: Filters
fi: Suodattimet

source: More actions
fi: Lisää toimintoja

source: Invert selection
fi: Käänteinen valinta

source: Define as current image
fi: Määritä käytettäväksi kuvaksi

source: Expand image to fit
fi: Laajenna kuva sopivaksi

source: Open As New Image
fi: Avaa uutena kuvana

source: Keyboard Shortcuts
fi: Pikanäppäimet

source: General
fi: Yleinen

source: Main menu
fi: Päävalikko

source: Toggle the menu-bar
fi: Vaihda valikko

source: Image
fi: Kuva

source: Open a picture
fi: Avaa kuva

source: Reload image from disk
fi: Lataa kuva levyltä uudelleen

source: Save picture as…
fi: Tallenna kuva nimellä…

source: Close the active image
fi: Sulje aktiivinen kuva

source: Open the tool options menu
fi: Avaa työkalun valikko

source: Back to previous tool
fi: Takaisin edelliseen työkaluun

source: Apply a transformation
fi: Käytä muunnosta

source: Toggle the preview
fi: Vaihda esikatseluun

source: Selection
fi: Valinta valinnat

source: Delete the selection
fi: Poista valinta

source: Import a file as the selection
fi: Tuo tiedosto valintana

source: Edit the main color (left click)
fi: Muokkaa pääväriä (hiiren vasen)

source: Edit the secondary color (right click)
fi: Muokkaa toissijaista väriä (hiiren oikea)

source: History
fi: Historia

source: Navigation
fi: Liikkuminen

source: Tabs
fi: Välilehdet

source: Toggle fullscreen mode
fi: Koko näyttöön

source: Toggle toolbars visibility
fi: Työkalujen näkyvyys

source: Touch gestures
fi: Kosketuksen eleet

source: Loading…
fi: Ladataan…

source: Exit fullscreen
fi: Poistu koko näytöstä

source: What's new in Drawing
fi: Drawing, mitä uutta?

source: Dismiss
fi: Hylkää

source: Undo %s
fi: Kumoa %s

source: Redo %s
fi: Uudelleen %s

source: Attempt to save an invalid state
fi: Yritä tallentaa virheellinen tila

source: Error: no tool '%s'
fi: Virhe: ei työkalua "%s"

source: New pixbuf empty, no change applied to %s
fi: Uusi pixbuf on tyhjä, ei muutosta %s

source: Unsaved file
fi: Tallentamaton

source: %s frames per second
fi: %s kuvaa sekunnissa

source: Show the app version
fi: Sovelluksen versio

source: Open a new window
fi: Avaa uusi ikkuna

source: Open a new tab
fi: Avaa uusi välilehti

source: Edit the clipboard content
fi: Muokkaa leikepöydän sisältöä

source: This version isn't stable!
fi: Tämä versio ei ole vakaa!

source: Report bugs or ideas
fi: Ilmoita virheitä ja ideoita

source: translator-credits
fi: Kimmo Kujansuu

source: GNOME's "Art Libre" icon set authors
fi: GNOME "Art Libre"-kuvakeet tekivät

source: Simple image editor for Linux
fi: Ohjelma piirtämiseen Linuxille

source: Official webpage
fi: Virallinen verkkosivu

source: Error opening this file.
fi: Virhe avattaessa tiedostoa.

source: Did you mean %s ?
fi: Tarkoititko %s?

source: Cancel
fi: Peru

source: Create
fi: Luo

source: New images
fi: Uusi kuva

source: Default width
fi: Leveys oletuksena

source: Default height
fi: Korkeus oletuksena

source: Default color
fi: Väri 1

source: Images saving
fi: Kuvan tallennus

source: JPEG and BMP images can't handle transparency.
fi: Kuvat JPEG ja BMP eivät omaa läpinäkyvyyden ominaisuutta.

source: If you save your images in these formats, what do want to use to replace transparent pixels?
fi: Tallentaessa näihin muotoihin, tulee sinun päättää millä korvaat läpinäkyvät pikselit?

source: White
fi: Valkoinen

source: Black
fi: Musta

source: Checkboard
fi: Harmaa väritaulu

source: Nothing
fi: Ei mitään

source: Ask before saving
fi: Kysy tallentaessa

source: You can zoom with Ctrl+scrolling, or only scrolling.
fi: Voit suurentaa painamalla Ctrl ja vierittää hiirellä.

source: See the user help manual for explanations.
fi: Katso ohjeet oppaasta.

source: Use 'Ctrl' to zoom
fi: Suurenna painamalla "Ctrl"

source: Appearance
fi: Ulkoasu

source: Use big icons
fi: Suuret kuvakkeet

source: Additional tools
fi: Lisätyökalut

source: These tools are not as reliable and useful as they should be, so they are not all enabled by default.
fi: Lisätyökalut eivät ole niin luotettavia ja hyödyllisiä kuin niiden pitäisi olla, joten ne eivät ole oletuksena esillä.

source: Eraser
fi: Pyyhekumi

source: Highlighter
fi: Korostuskynä

source: Brush
fi: Sivellin

source: Points
fi: Pisteet

source: Free selection
fi: Vapaa valinta

source: Color selection
fi: Värin valinta

source: Color Picker
fi: Värin poiminta

source: Paint
fi: Maalaa

source: Use color editor by default
fi: Värien muokkaus oletuksena

source: You can use a simple color palette, or use a full RGBA color editor.
fi: Voit käyttää väripalettia tai RGBA-värien muokkausta.

source: Advanced options
fi: Lisäasetukset

source: Preview size
fi: Esikatselun koko

source: Development features
fi: Kehitysvaiheen ominaisuudet

source: Background color
fi: Taustaväri

source: Prefer dark theme variant
fi: Suosi tummaa teemaa

source: Layout
fi: Asettelu

source: The recommended value is "Automatic".
fi: Suositus on "Automaattinen".

source: Automatic
fi: Automaattinen

source: Compact
fi: Tiivis

source: Legacy
fi: Perinteinen

source: Legacy (symbolic icons)
fi: Perinteinen (symboliset kuvakkeet)

source: Menubar only
fi: Vain valikko

source: Toolbar only
fi: Vain työkalurivi

source: Toolbar only (symbolic icons)
fi: Vain työkalurivi (symboliset kuvakkeet)

source: Path
fi: Polku

source: Format
fi: Muoto

source: Colorspace
fi: Värialue

source: Invalid format
fi: Väärä formaatti

source: Failed to replace transparency
fi: Korvaaminen läpinäkyvyyteen epäonnistui

source: Failed to save %s
fi: Tallennus %s epäonnistui

source: Failed to reload %s
fi: Ladatessa %s uudelleen epäonnistui

source: Untitled
fi: Nimetön

source: this picture
fi: tämä kuva

source: Discard
fi: Hylkää

source: There are unsaved modifications to %s.
fi: Kohteessa %s on tallentamattomia muutoksia.

source: A part of the image is selected: the pixels beneath the selection will be saved with a color you might not expect!
fi: Kuvasta osa on valittu: valinnan alla olevat pikselit tallennetaan värillä, jota et ehkä odotanut!

source: Modifications from the current tool haven't been applied.
fi: Nykyisen työkalun muutoksia ei ole otettu käyttöön.

source: Apply & save
fi: Käytä ja tallenna

source: Deselect & save
fi: Poista valinta ja tallenna

source: Save anyway
fi: Tallenna kuitenkin

source: Do you want to save anyway?
fi: Haluatko silti tallentaa?

source: Replace
fi: Korvaa

source: This file format doesn't support transparent colors.
fi: Tämä kuvamuoto ei tue läpinäkyvyyttä.

source: You can save the image as a PNG file, or replace transparency with:
fi: Voit tallentaa png-kuvana tai korvata läpinäkyvyyden:

source: Replace transparency with:
fi: Korvaa läpinäkyvyyttä seuraavasti:

source: The selection pixbuf is empty.
fi: Valinta pixbuf on tyhjä.

source: The selection path is empty.
fi: Valintapolku on tyhjä.

source: Failed to load tool: %s
fi: Työkalun lataaminen epäonnistui: %s

source: Error starting the application, please report this bug.
fi: Virhe sovelluksen avaamisessa, ilmoita virheestä.

source: The clipboard doesn't contain any image.
fi: Leikepöydällä ei ole yhtään kuvaa.

source: The file %s is already opened
fi: Tiedosto %s on jo avattuna

source: Open again
fi: Avaa uudelleen

source: Switch to this image
fi: Vaihda tähän kuvaan

source: Modifications will take effect in the next new window.
fi: Muutokset tulevat voimaan seuraavassa uudessa ikkunassa.

source: Middle-click or press F8 to show/hide controls.
fi: Paina keskipainiketta tai F8 joka näyttää tai piilottaa säätimet.

source: Press F11 to exit fullscreen.
fi: Painamalla F11 poistuu koko näytöstä.

source: Error loading the bottom pane for the tool '%s', please report this bug.
fi: Virhe ladattaessa työkalun "%s" paneelia, ilmoita virheestä.

source: Loading %s
fi: Ladataan %s

source: New Tab
fi: Uusi välilehti

source: Discard changes
fi: Hylkää muutokset

source: Where do you want to open %s?
fi: Missä haluat avata tämän %s?

source: these files
fi: nämä tiedostot

source: What do you want to do with %s?
fi: Mitä haluat tehdä %s kanssa?

source: Image copied to clipboard
fi: Kuva kopioitu leikepöydälle

source: Import a picture
fi: Tuo kuva

source: Required tool is not available
fi: Pakollinen työkalu ei ole käytettävissä

source: Transparent
fi: Läpinäkyvä

source: %s%% transparent
fi: %s%% läpinäkyvä

source: Grey
fi: Harmaa

source: Orange
fi: Oranssi

source: Brown
fi: Ruskea

source: Probably brown
fi: Ruska

source: Red
fi: Punainen

source: Green
fi: Vihreä

source: Blue
fi: Sininen

source: Yellow
fi: Keltainen

source: Magenta
fi: Purppura

source: Purple
fi: Violetti

source: Cyan
fi: Syaani

source: Probably teal
fi: Turkoosi

source: Unknown color name
fi: Tuntematon värin nimi

source: All pictures
fi: Kaikki kuvat

source: PNG images
fi: PNG

source: JPEG images
fi: JPEG

source: BMP images
fi: BMP

source: %s isn't an image.
fi: %s ei ole kuva.

source: Sorry, WEBP images can't be loaded by this app.
fi: Sovellus ei voi ladata webp-kuvia.

source: Despite its name, %s is a WEBP file.
fi: Nimestä huolimatta %s on webp-tiedosto.

source: Continue
fi: Jatka

source: The area seems poorly delimited, or is very complex.
fi: Alue näyttää huonosti rajatulta tai monimutkaiselta.

source: This algorithm may not be able to manage the wanted area.
fi: Tämä algoritmi ei ehkä pysty käsittelemään haluttua aluetta.

source: Do you want to abort the operation, or to let the tool struggle ?
fi: Haluatko keskeyttää tai antaa työkalun taistella?

source: percents
fi: prosentit

source: degrees
fi: astetta

source: Highlight (dark)
fi: Korosta (tumma)

source: Main color
fi: Väri 1

source: Secondary color
fi: Väri 2

source: Tool size
fi: Työkalun koko

source: No options
fi: Ei valintoja

source: How the color will be applied to the existing pixels
fi: Kuinka väriä käytetään kuvapisteisiin

source: Back to the palette
fi: Takaisin palettiin

source: Palette
fi: Paletti

source: Selection options
fi: Valinta valinnat

source: Replace with…
fi: Korvaa…

source: Transparency
fi: Läpinäkyvä alue

source: Extract from this color
fi: Poimi tästä väristä

source: More options
fi: Lisää vailintoja

source: Expand with…
fi: Laajenna…

source: Select a filter…
fi: Valitse suodatin…

source: Angle (degrees)
fi: Kulma (astetta)

source: Angle
fi: Kulma

source: Rotate left
fi: Vasemmalle

source: Rotate right
fi: Oikealle

source: Flip horizontally
fi: Peilaa vaakaan

source: Flip vertically
fi: Peilaa pystyyn

source: Keep proportions
fi: Pidä mittasuhteet

source: Always
fi: Aina

source: When scaling from corners
fi: Kun skaalataan kulmista

source: When setting values manually
fi: Kun arvot annetaan manuaalisesti

source: Never
fi: Ei koskaan

source: Pixels
fi: Pikseliä

source: Percentage
fi: Prosenttia

source: Horizontal deformation
fi: Vaaka muodonmuutos

source: Vertical deformation
fi: Pysty muodonmuutos

source: Can't start operation: wrong tool id (expected {0}, got {1})
fi: Toimintoa ei voi aloittaa: väärä työkalu (odotettu {0}, saatu {1})

source: Line shape
fi: Viivan muoto

source: Round
fi: Pyöreä

source: Square
fi: Neliö

source: Outline
fi: Ääriviivalla

source: No dashes
fi: Ei katkoviivaa

source: Simple dashes
fi: Katkoviivat

source: Long dashes
fi: Pitkä katkoviiva

source: Short dashes
fi: Lyhyt katkoviiva

source: Alternated dashes
fi: Vuorotteleva katkoviiva

source: No arrow
fi: Ei nuolia

source: Simple arrow
fi: Nuoli

source: Double arrow
fi: Kaksoisnuoli

source: Antialiasing
fi: Reunapehmennys

source: Simple brush
fi: Sivellin

source: Airbrush
fi: Suihke

source: Hairy brush
fi: Harja

source: Calligraphic nib
fi: Tekstauskynä

source: Right-handed nib
fi: Terä oikea

source: Vertical nib
fi: Pystyterä

source: Left-handed nib
fi: Terä vasen

source: Horizontal nib
fi: Vaakaterä

source: Rubber eraser
fi: Pyyhekumi

source: Rectangle area
fi: Suorakulmion alue

source: Remove color
fi: Poista väri

source: Blur
fi: Sumennus
